Revit 2027 API
ExportLayerInfo.SetCutLayerModifiers Method
 Sets a cut layer modifier array to the layer info.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetCutLayerModifiers(
	IList<LayerModifier> cutLayermodifiers
)
Public Sub SetCutLayerModifiers (
	cutLayermodifiers As IList(Of LayerModifier)
)
public:
void SetCutLayerModifiers(
	IList<LayerModifier^>^ cutLayermodifiers
)
member SetCutLayerModifiers :
        cutLayermodifiers : IList<LayerModifier> -> unit
Parameters
cutLayermodifiers IList<LayerModifier>
 The cut layer modifier array.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportLayerInfo Class
Autodesk.Revit.DB Namespace